# 6. Реализовать два небольших скрипта:
# а) бесконечный итератор, генерирующий целые числа, начиная с указанного,
# б) бесконечный итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.

from itertools import count

number = int(input('Введите число: '))
print('Сейчас будет бесконечный итератор: продолжить?')
answer = input(f'Y/Q: ')
if answer == 'Y' or answer == 'y':
    for el in count(number):
        print(el)
elif answer == 'Q' or answer == 'q':
    print('Может, ещё раз?')
else:
    print('Неизвестный ответ!')

