# Task3.
"""Создать текстовый файл (не программно), построчно записать фамилии сотрудников и величину их окладов.
Определить, кто из сотрудников имеет оклад менее 20 тыс., вывести фамилии этих сотрудников.
Выполнить подсчет средней величины дохода сотрудников."""

with open('firm.txt') as f:
    rich = []
    pool = []
    my_list = f.read().split('\n')
    for el in my_list:
        el = el.split(' ')
        if float(el[1]) < 20000:
            pool.append(el[0])
        rich.append(el[1])
print('Оклад меньше 20000 у: {}'.format(pool))
print('Средний доход сотрудников составляет: {}'.format(sum(map(float, rich)) / len(rich)))
